# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$


n = int(input('Введите целое число: '))


def pi(n):

    pi = 0
    for i in range(n):
        pi = pi + 16**(-i) * (4/(8*i+1) - 2/(8*i+4) - 1/(8*i+5) - 1/(8*i+6))
    return pi


print(pi(n))
